# Pandas 1
Â© Advanced Analytics, Amir Ben Haim, 2024

Pandas is a library specialized in data manipulation, transformasion and saving data.

<br>
<br>
<hr class="dotted">
<br>
<br>

## Creating <code>df</code>

One of the main functions of pandas are the dataframes. Dataframes are tables on which the columns are the variables and the rows are the observations.
- The columns can contain any data type
- All the columns must have the same numer of rows
- We can create datasets by passing a dictionary to the dataframe function

In [1]:
### First we have to import the pandas
import pandas as pd

In [2]:
# Reminder for dictionary
d = {
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi','barbara','chen','debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    }

d

{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
 'name': ['Avi',
  'Betti',
  'Clair',
  'Doron',
  'Eli',
  'abi',
  'barbara',
  'chen',
  'debra',
  'eylin'],
 'age': [25, 40, 30.5, 25, 32, 40, 50, 46.5, 27, 35],
 'student': [True, False, False, True, False, True, False, True, False, False]}

In [3]:
type(d)

dict

In [4]:
d.keys()

dict_keys(['id', 'name', 'age', 'student'])

In [5]:
d.values()

dict_values([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], ['Avi', 'Betti', 'Clair', 'Doron', 'Eli', 'abi', 'barbara', 'chen', 'debra', 'eylin'], [25, 40, 30.5, 25, 32, 40, 50, 46.5, 27, 35], [True, False, False, True, False, True, False, True, False, False]])

In [6]:
# Creating a DataFrame
df = pd.DataFrame(d)
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [7]:
# Another way for Creating a DataFrame
df = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi','barbara','chen','debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    })
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [8]:
# ERROR
# arrays must all be same length
df_Error = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti'],                 # Only 2 values
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    })


df_Error

ValueError: All arrays must be of the same length

In [9]:
# Can we have different data types in the same column ??!
# Well, not exactly. it looks like it works but basiclly we get colums with datatype "object"
df_Not_Exactly_An_Error = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,'8','9',10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi',86,77,'debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,'46.5','27',35],
      'student':[True,False,False,True,False,True,False,True,4.5,6]

    })

df_Not_Exactly_An_Error


# dtype "object" in python can hold any python object, not only "strings". It can hold "list", "dict" and so on...
# In Pandas columns with mixed types or strings are stored with "object" dtype.

# Can be problematic way to work, we bettr avoid that !!!

   id   name   age student
0   1    Avi    25    True
1   2  Betti    40   False
2   3  Clair  30.5   False
3   4  Doron    25    True
4   5    Eli    32   False
5   6    abi    40    True
6   7     86    50   False
7   8     77  46.5    True
8   9  debra    27     4.5
9  10  eylin    35       6

In [10]:
# What are the data types
df_Not_Exactly_An_Error.dtypes

id         object
name       object
age        object
student    object
dtype: object

In [11]:
# what are the columns data types for the NORMAL df ?
df.dtypes

id           int64
name        object
age        float64
student       bool
dtype: object

<br>
<p style = "font-size:25px">Let's check the difference between the two DataFrames</p>

In [12]:
# For example, let's try to use the function 'mean' to the values in 'age'
# ERROR
df_Not_Exactly_An_Error["age"].mean()
# Look at the error we recieved: "unsupported operand type(s) for +: 'int' and 'str"

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [ ]:
# Works greate!
df["age"].mean()

In [13]:
# Same thing goes for 'id', let's try to sum the numbers, just for the example
# ERROR
df_Not_Exactly_An_Error["id"].sum()
# Look at the error we recieved: "unsupported operand type(s) for +: 'int' and 'str'"

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [14]:
# Works greate!
df["id"].sum()

np.int64(55)

In [15]:
# Same thing goes for 'name', let's try to sum the values, just for the example
# ERROR
df_Not_Exactly_An_Error["name"].sum()
# Look at the error we recieved: "can only concatenate str (not "int") to str"

TypeError: can only concatenate str (not "int") to str

In [16]:
# Works greate!
df["name"].sum()

'AviBettiClairDoronEliabibarbarachendebraeylin'

In [17]:
# 'student' column works, but Why ??
df_Not_Exactly_An_Error["student"].sum()
# Because he considers "True" = 1, and "False" = 0

14.5

In [18]:
# Works greate!
df["student"].sum()

np.int64(4)

In [19]:
# How can we fix the problem for all the columns
# We'll convert the columns datatypes
df_Not_Exactly_An_Error["id"] = df_Not_Exactly_An_Error["id"].astype(int)
df_Not_Exactly_An_Error["name"] = df_Not_Exactly_An_Error["name"].astype(str)
df_Not_Exactly_An_Error["age"] = df_Not_Exactly_An_Error["age"].astype(float)

df_Not_Exactly_An_Error["student"] = df_Not_Exactly_An_Error["student"].astype(bool)


df_Not_Exactly_An_Error.dtypes

id           int64
name        object
age        float64
student       bool
dtype: object

In [20]:
df_Not_Exactly_An_Error

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True
4   5    Eli  32.0    False
5   6    abi  40.0     True
6   7     86  50.0    False
7   8     77  46.5     True
8   9  debra  27.0     True
9  10  eylin  35.0     True

In [21]:
# No more problems!
df_Not_Exactly_An_Error.sum()

id                                             55
name       AviBettiClairDoronEliabi8677debraeylin
age                                         351.0
student                                         6
dtype: object

<br>
<p style = "font-size:25px">Important Conclusion !!!</p>

- All columns must all be the same length
- In Pandas columns with 'mixed types' or 'strings' are stored with "object" dtype. we better avoid that, and we'll force the colums to be as the same type with method "astype()"</p>

<br>
<br>
<hr class="dotted">
<br>
<br>

## A few common <code>df</code> methods

In [22]:
#Back to our df
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [23]:
df.head()

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True
4   5    Eli  32.0    False

In [24]:
df.head(2)

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False

In [25]:
df.tail()

   id     name   age  student
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [26]:
df.tail(2)

   id   name   age  student
8   9  debra  27.0    False
9  10  eylin  35.0    False

In [27]:
df.describe()

             id       age
count  10.00000  10.00000
mean    5.50000  35.10000
std     3.02765   8.82169
min     1.00000  25.00000
25%     3.25000  27.87500
50%     5.50000  33.50000
75%     7.75000  40.00000
max    10.00000  50.00000

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       10 non-null     int64
 1   name     10 non-null     object
 2   age      10 non-null     float64
 3   student  10 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 382.0+ bytes

In [29]:
# when sorting lower letters have higher value than upper letters
df.sort_values(ascending=False,by='name')

   id     name   age  student
9  10    eylin  35.0    False
8   9    debra  27.0    False
7   8     chen  46.5     True
6   7  barbara  50.0    False
5   6      abi  40.0     True
4   5      Eli  32.0    False
3   4    Doron  25.0     True
2   3    Clair  30.5    False
1   2    Betti  40.0    False
0   1      Avi  25.0     True

In [30]:
df.sort_values(ascending=True,by='name')

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [31]:
df.sort_values(ascending=False,by='id')

   id     name   age  student
9  10    eylin  35.0    False
8   9    debra  27.0    False
7   8     chen  46.5     True
6   7  barbara  50.0    False
5   6      abi  40.0     True
4   5      Eli  32.0    False
3   4    Doron  25.0     True
2   3    Clair  30.5    False
1   2    Betti  40.0    False
0   1      Avi  25.0     True

In [32]:
df.to_numpy()

array([[1, 'Avi', 25.0, True],
       [2, 'Betti', 40.0, False],
       [3, 'Clair', 30.5, False],
       [4, 'Doron', 25.0, True],
       [5, 'Eli', 32.0, False],
       [6, 'abi', 40.0, True],
       [7, 'barbara', 50.0, False],
       [8, 'chen', 46.5, True],
       [9, 'debra', 27.0, False],
       [10, 'eylin', 35.0, False]], dtype=object)

In [33]:
df[['id','age','student']].mean()

id          5.5
age        35.1
student     0.4
dtype: float64

In [34]:
df[['id','age','student']].median()

id          5.5
age        33.5
student     0.0
dtype: float64

In [35]:
df[['id','age','student']].sum()

id          55.0
age        351.0
student      4.0
dtype: float64

In [36]:
df[['id','age','student']].count()

id         10
age        10
student    10
dtype: int64

In [37]:
# Counts the occurrences for each unique value
df['student'].value_counts()

student
False    6
True     4
Name: count, dtype: int64

<br>
<br>
<hr class="dotted">
<br>
<br>

## A few common <code>df</code> attributes

In [38]:
df.dtypes

id           int64
name        object
age        float64
student       bool
dtype: object

In [39]:
df.columns

Index(['id', 'name', 'age', 'student'], dtype='object')

In [40]:
df.values

array([[1, 'Avi', 25.0, True],
       [2, 'Betti', 40.0, False],
       [3, 'Clair', 30.5, False],
       [4, 'Doron', 25.0, True],
       [5, 'Eli', 32.0, False],
       [6, 'abi', 40.0, True],
       [7, 'barbara', 50.0, False],
       [8, 'chen', 46.5, True],
       [9, 'debra', 27.0, False],
       [10, 'eylin', 35.0, False]], dtype=object)

<br>
<br>
<hr class="dotted">
<br>
<br>

## Selecting & Slicing & Filtering - Index Operstor <code>[]</code>

### Selecting Columns

#### Possible: One column or specific columns

In [41]:
# one column
df['id']
# returned Data Type = Series
# If we select a single COLUMN from a DataFrame we get a Series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [42]:
# one column
df['name']
# returned Data Type = Series
# If we select a single COLUMN from a DataFrame we get a Series

0        Avi
1      Betti
2      Clair
3      Doron
4        Eli
5        abi
6    barbara
7       chen
8      debra
9      eylin
Name: name, dtype: object

In [43]:
# two specific columns
# Notice the extra []
df[['id','name']]
# returned Data Type = DataFrame
# If we select a MULTIPLE COLUMNS from a DataFrame we get a Dataframe

   id     name
0   1      Avi
1   2    Betti
2   3    Clair
3   4    Doron
4   5      Eli
5   6      abi
6   7  barbara
7   8     chen
8   9    debra
9  10    eylin

In [44]:
# two specific columns
# Notice the extra []
df[['id','age']]
# returned Data Type = DataFrame
# If we select a MULTIPLE COLUMNS from a DataFrame we get a Dataframe

   id   age
0   1  25.0
1   2  40.0
2   3  30.5
3   4  25.0
4   5  32.0
5   6  40.0
6   7  50.0
7   8  46.5
8   9  27.0
9  10  35.0

In [45]:
# three specific columns
# Notice the extra []
df[['id','age','name']]
# returned Data Type = DataFrame

   id   age     name
0   1  25.0      Avi
1   2  40.0    Betti
2   3  30.5    Clair
3   4  25.0    Doron
4   5  32.0      Eli
5   6  40.0      abi
6   7  50.0  barbara
7   8  46.5     chen
8   9  27.0    debra
9  10  35.0    eylin

#### Not Possible: columns Range

In [46]:
# Error
# columns range - not possible with the index operator
df['id':'age']

TypeError: cannot do slice indexing on RangeIndex with these indexers [id] of type str

### Slicing rows (with indexes)
Slicing rows (= by index)

#### Possible: rows Range

In [47]:
# Row range
df[0:4]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [48]:
# Row range
df[2:4]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [49]:
# Row range
df[-3:-1]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
7   8   chen  46.5     True
8   9  debra  27.0    False

In [50]:
# Row range
df[0:1]
# returned Data Type = DataFrame --- Even when we got only one row!!

   id name   age  student
0   1  Avi  25.0     True

In [51]:
# Row range
df[2:3]
# returned Data Type = DataFrame --- Even when we got only one row!!

   id   name   age  student
2   3  Clair  30.5    False

In [52]:
# Row range with step
df[0:4:2]
# returned Data Type = DataFrame

   id   name   age  student
0   1    Avi  25.0     True
2   3  Clair  30.5    False

In [53]:
# Row range with step
df[::-1]
# returned Data Type = DataFrame

   id     name   age  student
9  10    eylin  35.0    False
8   9    debra  27.0    False
7   8     chen  46.5     True
6   7  barbara  50.0    False
5   6      abi  40.0     True
4   5      Eli  32.0    False
3   4    Doron  25.0     True
2   3    Clair  30.5    False
1   2    Betti  40.0    False
0   1      Avi  25.0     True

In [54]:
# Row range with step - the step didn't really matter
df[0:4:1]
# returned Data Type = DataFrame

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [55]:
# Row range
df[4:0]
# returned Data Type =   E M P T Y   DataFrame, because you can't start from index row 4 and finish at 0

Empty DataFrame
Columns: [id, name, age, student]
Index: []

In [56]:
# Row range
df[4:0:-1]
# returned Data Type =  N O T   A N   E M P T Y   DataFrame, because the step change the range direction, we started from index 4 and then went backwards (also notice we didn't get index 0)

   id   name   age  student
4   5    Eli  32.0    False
3   4  Doron  25.0     True
2   3  Clair  30.5    False
1   2  Betti  40.0    False

#### Not Possible: One Row or specific Rows

In [57]:
# Error
# Specific Row - not possible with the index operator
df[[0,2]]

KeyError: "None of [Index([0, 2], dtype='int64')] are in the [columns]"

In [58]:
# Error
# Specific Row - not possible with the index operator
df[0,2]

KeyError: (0, 2)

In [59]:
# Error
# Specific Row - not possible with the index operator
df[2]

KeyError: 2

### Filtering (Subset) rows (by condition)

filtering rows (= by Conditions)

 Comparison Operatoes
- <code>==</code>
- <code>!=</code>
- <code><=</code>
- <code><</code>
- <code>>=</code>
- <code>></code>

Logical Operatoes
<br>
 - `|` for 'or'
 - `&` for 'and'
 - `~` for 'not'

#### Possible: One Condition

In [60]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [61]:
# Filtering Rows by One condition
df[df['age'] > 30]

   id     name   age  student
1   2    Betti  40.0    False
2   3    Clair  30.5    False
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
9  10    eylin  35.0    False

In [62]:
#   B R E A K D O W N   -   Filtering Rows by One condition
df['age']

0    25.0
1    40.0
2    30.5
3    25.0
4    32.0
5    40.0
6    50.0
7    46.5
8    27.0
9    35.0
Name: age, dtype: float64

In [63]:
#   B R E A K D O W N   -   Filtering Rows by One condition
df['age'] > 30

0    False
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9     True
Name: age, dtype: bool

In [64]:
# Filtering Rows by One condition
df[df['id'] == 3]

   id   name   age  student
2   3  Clair  30.5    False

In [65]:
# Filtering Rows by One condition
df[df['student'] != True]

   id     name   age  student
1   2    Betti  40.0    False
2   3    Clair  30.5    False
4   5      Eli  32.0    False
6   7  barbara  50.0    False
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [66]:
df[df['age'] >= 40]

   id     name   age  student
1   2    Betti  40.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True

#### Possible: Multiple Conditions

In [67]:
# Filtering Rows by Multiple conditions
# and
df[   (df['age'] > 30)   &   (df['student'] == True)   ]

   id  name   age  student
5   6   abi  40.0     True
7   8  chen  46.5     True

In [68]:
# Filtering Rows by Multiple conditions
# or
df[   (df['age'] > 30)   |   (df['student'] == True)   ]

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
9  10    eylin  35.0    False

In [69]:
# Filtering Rows by Multiple conditions
# and + or
df[   (df['age'] > 45) |   ((df['student'] == True) & (df['id'] > 5))   ]

   id     name   age  student
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True

In [70]:
# Using a method 'isin()'
df[   df['age'].isin([40,50,30.5])   ]

   id     name   age  student
1   2    Betti  40.0    False
2   3    Clair  30.5    False
5   6      abi  40.0     True
6   7  barbara  50.0    False

In [71]:
# Not '~'
# Using a method 'isin()'
df[   ~   df['age'].isin([40,50,30.5])   ]

   id   name   age  student
0   1    Avi  25.0     True
3   4  Doron  25.0     True
4   5    Eli  32.0    False
7   8   chen  46.5     True
8   9  debra  27.0    False
9  10  eylin  35.0    False

#### Possible: isnull Condition

<br>
<p style = "font-size:25px">Inserting a new row with <code>Null</code> values</p>

In [72]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [73]:
df.loc[10] = [11,'ben',None,True]
df

C:\Users\user\AppData\Local\Temp\ipykernel_2412\1429617649.py:1: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df.loc[10] = [11,'ben',None,True]

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
2    3    Clair  30.5    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [74]:
df['age'].isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
Name: age, dtype: bool

In [75]:
# filtering 'Null' rows in column 'age'
df[df['age'].isnull()]

    id name  age  student
10  11  ben  NaN     True

In [76]:
# Same thing as 'isnull()'
df[df['age'].isna()]

    id name  age  student
10  11  ben  NaN     True

In [77]:
# filtering 'Null' rows in column 'age'
df[df['age'].notnull()]

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [78]:
# Same thing as 'notnull()'
df[df['age'].notna()]

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

<br>
<br>
<hr class="dotted">
<br>
<br>

## <code>.loc[]</code> and <code>.iloc[]</code>

- [] = Specific rows/column
- : = Range for rows/column

In [79]:
# Error
# index operator not possible to control both rows and columns
df[0:4, 'name']

InvalidIndexError: (slice(0, 4, None), 'name')

In [80]:
# Error
# index operator not possible to control both rows and columns
df[df['student'] != True, 'name']

InvalidIndexError: (0     False
1      True
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9      True
10    False
Name: student, dtype: bool, 'name')

### <code>.loc[]</code>

To select specific rows and specific columns we use the function <code>loc</code>

In [81]:
## slicing rows ranging from 2 to 4 and selecting specific columns ('name' and 'student')
df.loc[2:4,['name','student']]

# Notice, when using 'loc[]' we also get row with index 4

    name  student
2  Clair    False
3  Doron     True
4    Eli    False

In [82]:
## slicing rows ranging from 2 to 4 and selecting range columns ('name' to 'student')
df.loc[2:4,'name':'student']

# Notice, when using 'loc[]' we also get row with index 4

    name   age  student
2  Clair  30.5    False
3  Doron  25.0     True
4    Eli  32.0    False

In [83]:
# We can do the same with rows
## slicing specific rows 2 and 4 and selecting range columns ('name' to 'student')
df.loc[[2,4],'name':'student']

    name   age  student
2  Clair  30.5    False
4    Eli  32.0    False

### <code>.iloc[]</code>
We can also use <code>iloc[]</code> to select specific rows and specific columns we use the function 'loc'

In [84]:
## slicing rows ranging from 2 to 3 and selecting range columns (all columns)
df.iloc[2:4,:]

# Why ??! didn't we get row number 4. just like we got before when using loc ??!
# Notice, when using 'iloc[]' we didn't get row with index 4

   id   name   age  student
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [85]:
## slicing rows ranging from 2 to 3 and selecting specific columns ('id','age')
df.iloc[2:4,[0,2]]
# Notice, when using 'iloc[]' we didn't get row with index 4

   id   age
2   3  30.5
3   4  25.0

In [86]:
## slicing specific rows 2 and 4 and selecting range columns
df.iloc[[2,4],0:3]

# Notice, when using 'iloc[]' we didn't get column with index 3

   id   name   age
2   3  Clair  30.5
4   5    Eli  32.0

In [87]:
# ERROR
## we can't use columns name with 'iloc[]'
df.iloc[[2,4],'id':'age']

TypeError: cannot do positional indexing on Index with these indexers [id] of type str

### <code>.at[]</code>

In [88]:
# to retrieve the content of a specific cell we use the function 'at'
df.at[4,"name"]

'Eli'

In [89]:
## An alternative way of obtaining a cell are
df.loc[4,"name"]

'Eli'

### Filtering with <code>.loc[]</code>

In [90]:
# Filtering with 'loc[]'
df.loc[ df["id"]>3 ,'id':'age']

    id     name   age
3    4    Doron  25.0
4    5      Eli  32.0
5    6      abi  40.0
6    7  barbara  50.0
7    8     chen  46.5
8    9    debra  27.0
9   10    eylin  35.0
10  11      ben   NaN

<p style = "font-size:25px"> So, what is the difference between loc and iloc ?</p>
- loc = is <b><u>label-based</u></b>, which means that you have to specify rows and columns based on their row and column labels<br>
- iloc = is integer <b><u>position-based</u></b>, so you have to specify rows and columns by their integer position values (0-based integer position)
<br>
<br>

### <code>.loc[]</code> and <code>.iloc[]</code> last example

In [91]:
# Creating the same df, but this time with custom indexes --> not the default one!
# now the Indexes are 'a','b','c',....etc
# before they were '0','1','2',....

d2 = {
      'id':[1,2,3,4,5],
      'name':['Avi','Betti','Clair','Doron','Eli'],
      'age':[25,40,30.5,25,32],
      'student':[True,False,False,True,False]
    }

labels = ['a', 'b', 'c', 'd', 'e']

df2= pd.DataFrame(d2,index=labels)
df2

   id   name   age  student
a   1    Avi  25.0     True
b   2  Betti  40.0    False
c   3  Clair  30.5    False
d   4  Doron  25.0     True
e   5    Eli  32.0    False

In [92]:
# "iloc" refers only to the INDEX and can work both on rows and coloms
# The comma in the square brackets:
    # The parameters to the left of the comma always selects rows based on the row index
    # The parameters to the right of the comma always selects columns based on the column index

# Here we only refered to the rows, we asked for all of the rows, and also got all the column (when we dont specify the column --> we get all of them)
df2.iloc[:]

   id   name   age  student
a   1    Avi  25.0     True
b   2  Betti  40.0    False
c   3  Clair  30.5    False
d   4  Doron  25.0     True
e   5    Eli  32.0    False

In [93]:
# All rows, the 2 first columns --> Range (':')
df2.iloc[:,0:2]

   id   name
a   1    Avi
b   2  Betti
c   3  Clair
d   4  Doron
e   5    Eli

In [94]:
# 2 first rows, the 2 first columns --> Range (':')
df2.iloc[0:2,0:2]

   id   name
a   1    Avi
b   2  Betti

In [95]:
# 2 specific rows, 2 specific (',') columns --> Not Range
df2.iloc[[0,3],[0,2]]
# We've passed a list to the index operator --> not a RANGE as we did before !!!

   id   age
a   1  25.0
d   4  25.0

In [96]:
# "loc" refers only to the VALUES  and can work both on rows and coloms
# The comma in the square brackets:
    # The parameters to the left of the comma always selects rows based on the row value
    # The parameters to the right of the comma always selects columns based on the column value

# Here we only refered to the rows, we asked for all of the rows, and also got all the column (when we dont specify the column --> we get all of them)
df2.loc[:]

   id   name   age  student
a   1    Avi  25.0     True
b   2  Betti  40.0    False
c   3  Clair  30.5    False
d   4  Doron  25.0     True
e   5    Eli  32.0    False

In [97]:
# If we we will try to use "loc" and reffer to an index we will get an
# ERROR
df2.loc[0]

KeyError: 0

In [98]:
# If we we will use "loc" and reffer to a value we'll get the correct outcome
df2.loc['a']

id            1
name        Avi
age        25.0
student    True
Name: a, dtype: object

In [99]:
# All rows, the 2 first columns --> Range (':')
df2.loc[:,'id':'name']

   id   name
a   1    Avi
b   2  Betti
c   3  Clair
d   4  Doron
e   5    Eli

In [100]:
# 2 first rows, the 2 first columns --> Range (':')
df2.loc['a':'c','id':'name']

   id   name
a   1    Avi
b   2  Betti
c   3  Clair

In [101]:
# 2 specific rows (','), 2 specific (',') columns --> Not Range
df2.loc[['a','c'],['id','age']]
# We've passed a list --> not a RANGE as we did before !!!

   id   age
a   1  25.0
c   3  30.5

<br>
<br>
<hr class="dotted">
<br>
<br>

### When exactly do we get a `DataFrame` and when a `Series`

In [102]:
df

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
2    3    Clair  30.5    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

#### Columns

- One Column --> `Series`
- Two Column (or more) --> `df`

In [103]:
# One Column --> Series
df['name']

0         Avi
1       Betti
2       Clair
3       Doron
4         Eli
5         abi
6     barbara
7        chen
8       debra
9       eylin
10        ben
Name: name, dtype: object

In [104]:
# Two Column (or more) --> df
df[['name','age']]

       name   age
0       Avi  25.0
1     Betti  40.0
2     Clair  30.5
3     Doron  25.0
4       Eli  32.0
5       abi  40.0
6   barbara  50.0
7      chen  46.5
8     debra  27.0
9     eylin  35.0
10      ben   NaN

#### Rows

Notice the different behavior (the `type` that returns) <u>FOR THE SAME ONE ROW !</u>

In [105]:
# Rturned type = df
df[2:3]

   id   name   age  student
2   3  Clair  30.5    False

In [106]:
# Rturned type = df
df[df['id']==3]

   id   name   age  student
2   3  Clair  30.5    False

In [107]:
# Rturned type = Series
df.loc[2]

id             3
name       Clair
age         30.5
student    False
Name: 2, dtype: object

In [108]:
# Rturned type = df
df.loc[df['id']==3]

   id   name   age  student
2   3  Clair  30.5    False

In [109]:
# Rturned type = df
df.iloc[2:3]

   id   name   age  student
2   3  Clair  30.5    False

In [110]:
# Rturned type = Series
df.iloc[2]

id             3
name       Clair
age         30.5
student    False
Name: 2, dtype: object

<br>

<u>Why is that ??</u>
<br>
well, it depends on how we used the index operator
<br>
- When we use it to slice <u>WITH RANGE</u> --> Returned Type = `df` --> <u>(EVEN IF THE OUTCOME IS ONLY ONE ROW)</u>



- When we use it to filter <u>WITH A BOOLEAN SERIES</u> --> Returned Type = `df` --> <u>(EVEN IF THE OUTCOME IS ONLY ONE ROW)</u>


- When we use it to slice (again), but this time with <u>ONLY ONE VALUE</u> --> Returned Type = `series`

<br>
<br>
<hr class="dotted">
<br>
<br>

## dot operator <code>.</code>

In [113]:
# Different ways to select a columns

# The "index" operator --> []
# The "dot" operator --> .

#df['id']
df.id

# Both perform the same thing

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
Name: id, dtype: int64

In [114]:
df.name

0         Avi
1       Betti
2       Clair
3       Doron
4         Eli
5         abi
6     barbara
7        chen
8       debra
9       eylin
10        ben
Name: name, dtype: object

In [115]:
# Another example with the use of "sum()" method"

df.id.sum()
df['id'].sum()

# Both perform the same thing

np.int64(66)

In [116]:
# Selecting multiple columns
# To select multiple columns, you can pass a list of column names to the indexing operator

df[['id','name']]

# Or you can assign all your columns to a list variable and pass that variable to the indexing operator

col = ['id','name']
df[col]

    id     name
0    1      Avi
1    2    Betti
2    3    Clair
3    4    Doron
4    5      Eli
5    6      abi
6    7  barbara
7    8     chen
8    9    debra
9   10    eylin
10  11      ben

In [117]:
df

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
2    3    Clair  30.5    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [119]:
df.id>3

0     False
1     False
2     False
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
Name: id, dtype: bool

In [120]:
df['id']>3

0     False
1     False
2     False
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
Name: id, dtype: bool

In [121]:
# When creating a subset we can also use
    # the "index" [] operator
        # or
    # "dot" . operator

df[df.id>3]
df[df['id']>3]

# Same thing- Both return rows where the values in column 'Var1' bigger than 3

    id     name   age  student
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [122]:
# Same thing- Both return rows where the values in column 'Var1' equal to 3
df[df.id==3]
df[df['id']==3]

   id   name   age  student
2   3  Clair  30.5    False

In [123]:
# Error
df[df.id=3]
df[df['id']=3]

# Have to use DOUBLE ==

SyntaxError: cannot assign to attribute here. Maybe you meant '==' instead of '='? (3245654893.py, line 2)

In [124]:
# Same thing- Both return rows where the values in column 'Var1' not equal to 3
df[df.id!=3]
df[df['id']!=3]

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [125]:
df

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
2    3    Clair  30.5    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [126]:
# 2 Conditions -- Notice that we've added Parenthesis ()
df[(df.id!=3) & (df.student==True)]
df[(df['id']!=3) & (df['student']==True)]
# & --> "and" operator

    id   name   age  student
0    1    Avi  25.0     True
3    4  Doron  25.0     True
5    6    abi  40.0     True
7    8   chen  46.5     True
10  11    ben   NaN     True

In [127]:
# 2 Conditions -- Notice that we've added Parenthesis ()
df[(df.id!=3) | (df.student==True)]
df[(df['id']!=3) | (df['student']==True)]
# & --> "or" operator

    id     name   age  student
0    1      Avi  25.0     True
1    2    Betti  40.0    False
3    4    Doron  25.0     True
4    5      Eli  32.0    False
5    6      abi  40.0     True
6    7  barbara  50.0    False
7    8     chen  46.5     True
8    9    debra  27.0    False
9   10    eylin  35.0    False
10  11      ben   NaN     True

In [128]:
# 1 Condition and Specific columns --> we'll use "loc"
df.loc[df.id!=3,['id','student']]
df.loc[df['id']!=3,['id','student']]

    id  student
0    1     True
1    2    False
3    4     True
4    5    False
5    6     True
6    7    False
7    8     True
8    9    False
9   10    False
10  11     True

In [129]:
# 2 Conditions and Specific columns --> we'll use "loc"
df.loc[(df.id!=3) & (df.student==True) ,['id','student']]

df.loc[(df['id']!=3) & (df['student']==True),['id','student']]

    id  student
0    1     True
3    4     True
5    6     True
7    8     True
10  11     True

<br>
<br>
<hr class="dotted">
<br>
<br>

## Series

<br>Series is a type of list in pandas which can take integer values, string values, double values and more....
<br>Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [130]:
# Pandas Series
# Is like a column in a table
# Basicly it's like a data frame only that it has only one column
# It is a one-dimensional array holding data of any type

se = pd.Series([1,5,8,3])
se

0    1
1    5
2    8
3    3
dtype: int64

In [131]:
# Return first value
se[0]

np.int64(1)

In [132]:
# Return second value
se[1]

np.int64(5)

In [133]:
# Return the 3 first value
se[0:3]

0    1
1    5
2    8
dtype: int64

In [135]:
# Return specific 2 values
se[[0,3]]

0    1
3    3
dtype: int64

In [136]:
# Create specific Indexes (like we did before)
se = pd.Series([1,5,8,3], index = ["a","b","c","d"])
se

a    1
b    5
c    8
d    3
dtype: int64

In [137]:
# choosing the value in the "b" index
se["b"]

np.int64(5)

In [138]:
se = pd.Series({"a":1,"b":5,"c":8,"d":3})
se

a    1
b    5
c    8
d    3
dtype: int64

In [139]:
se.loc['a']

np.int64(1)

In [140]:
se.loc['b']

np.int64(5)

In [141]:
# Error
se.loc['b','c']

IndexingError: Too many indexers

In [142]:
# specific indexes
se.loc[['b','d']]

b    5
d    3
dtype: int64

In [144]:
# range indexes
se.loc['b':'d']

b    5
c    8
d    3
dtype: int64

In [145]:
se

a    1
b    5
c    8
d    3
dtype: int64

In [146]:
# Error
se.iloc['a']

TypeError: Cannot index by location index with a non-integer key

In [147]:
se.iloc[1]

np.int64(5)

In [148]:
se.iloc[2]

np.int64(8)

In [149]:
# Error
se.iloc[1,3]

IndexingError: Too many indexers

In [150]:
# specific indexes
se.iloc[[1,3]]

b    5
d    3
dtype: int64

In [151]:
# range indexes
se.iloc[1:3]

b    5
c    8
dtype: int64

In [152]:
se.sum()

np.int64(17)

In [153]:
se.mean()

np.float64(4.25)

In [154]:
se.describe()

count    4.000000
mean     4.250000
std      2.986079
min      1.000000
25%      2.500000
50%      4.000000
75%      5.750000
max      8.000000
dtype: float64

In [155]:
se.head(2)

a    1
b    5
dtype: int64

In [156]:
se.to_numpy()

array([1, 5, 8, 3])

In [157]:
se.dtype

dtype('int64')

In [158]:
se.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [160]:
se.values

array([1, 5, 8, 3])

In [163]:
df['id']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
Name: id, dtype: int64

In [164]:
se

a    1
b    5
c    8
d    3
dtype: int64

In [165]:
se.name
# there isn't any name

In [166]:
se
# there isn't any name

a    1
b    5
c    8
d    3
dtype: int64

In [167]:
se.name = 'SomeName'

In [168]:
se.name

'SomeName'

In [169]:
se

a    1
b    5
c    8
d    3
Name: SomeName, dtype: int64

In [171]:
se_index = pd.Series(se.index)
se_index

0    a
1    b
2    c
3    d
dtype: object

In [172]:
se

a    1
b    5
c    8
d    3
Name: SomeName, dtype: int64

In [173]:
se.name = 'id_num'
se

a    1
b    5
c    8
d    3
Name: id_num, dtype: int64

In [175]:
se_index.name = 'char'
se_index

0    a
1    b
2    c
3    d
Name: char, dtype: object

In [177]:
pd.DataFrame({se.name:list(se), se_index.name:list(se_index)})

   id_num char
0       1    a
1       5    b
2       8    c
3       3    d

In [178]:
{se.name:list(se), se_index.name:list(se_index)}

{'id_num': [1, 5, 8, 3], 'char': ['a', 'b', 'c', 'd']}

In [180]:
{se.name:se, se_index.name:se_index}

{'id_num': a    1
 b    5
 c    8
 d    3
 Name: id_num, dtype: int64,
 'char': 0    a
 1    b
 2    c
 3    d
 Name: char, dtype: object}

In [181]:
pd.DataFrame({se.name:se, se_index.name:se_index})

   id_num char
a     1.0  NaN
b     5.0  NaN
c     8.0  NaN
d     3.0  NaN
0     NaN    a
1     NaN    b
2     NaN    c
3     NaN    d

For conclusion: Series is like a column, a DataFrame is the whole table

<br>
<hr class="dotted">
<br>